app/views/leaderboards/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
            <tr>
                <td><%= User.find(movie.user_id).email %></td>