app/views/bollywoods/index.html.erb

            <tr>
                <td><%= User.find(bollywood.user_id).email %></td>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

    <% if @curscore.bcur>0 %>
    <% if @curscore.bcur!=Bollywood.count() %>
---
SELECT COUNT(*) FROM `bollywoods`