app/views/bollywoods/show.html.erb

SELECT COUNT(*) FROM `bollywoods`
---
    <% end %>
    <% if Bollywood.count() == @bollywood.id %>