app/views/hollywoods/index.html.erb

            <tr>
                <td><%= User.find(hollywood.user_id).email %></td>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

    <% if @curscore.hcur>0 %>
    <% if @curscore.hcur!=Hollywood.count() %>
---
SELECT COUNT(*) FROM `hollywoods`