app/views/hollywoods/show.html.erb

SELECT COUNT(*) FROM `hollywoods`
---
    <% end %>
    <% if Hollywood.count() == @hollywood.id %>