app/views/crickets/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
            <tr>
                <td><%= User.find(cricket.user_id).email %></td>

SELECT COUNT(*) FROM `crickets`
SELECT `crickets`.* FROM `crickets`
---
    <% if @curscore.ccur>0 %>
    <% if @curscore.ccur!=Cricket.count() %>