app/views/crickets/show.html.erb

SELECT COUNT(*) FROM `crickets`
---
    <% end %>
    <% if Cricket.count() == @cricket.id %>