app/views/footballs/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
            <tr>
                <td><%= User.find(football.user_id).email %></td>

SELECT COUNT(*) FROM `footballs`
---
    <% if @curscore.fcur>0 %>
    <% if @curscore.fcur!=Football.count() %>