app/views/footballs/show.html.erb

    <% end %>
    <% if Football.count() == @football.id %>
---
SELECT COUNT(*) FROM `footballs`