app/views/home/index.html.erb

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
---
        <h3><i><u>Sports</u></i></h3>
        <% if Leaderboard.find_by_user_id(current_user.id).cmax == -1 %>