app/controllers/bollywoods_controller.rb

  def index
    @curscore=Leaderboard.find_by_user_id(current_user.id)
    @bupd=Leaderboard.find_by_user_id(current_user.id)
    @bollywoods = Leaderboard.order('bmax DESC')
    if @bupd.bcur == Bollywood.count()
      @bupd.Bollywood = 0
      @bupd.bcur =0
      @bupd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY bmax DESC
SELECT COUNT(*) FROM `bollywoods`
UPDATE `leaderboards` SET `bcur` = 0, `Bollywood` = 0 WHERE `leaderboards`.`id` = 2

  def show
    @string=''
    @leaderbd=Leaderboard.find_by_user_id(current_user.id)
    @location='/bollywoods/'+(Integer(params[:id])+1).to_s
    @leaderbd.bcur=Integer(params[:id])
    if params[:id]=='1'
      @leaderbd.Bollywood=0
      @leaderbd.bmax=@leaderbd.bmax > @leaderbd.Bollywood ? @leaderbd.bmax : @leaderbd.Bollywood
    end
    @leaderbd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
UPDATE `leaderboards` SET `Bollywood` = 10, `updated_at` = '2017-09-17 11:42:11', `bmax` = 10 WHERE `leaderboards`.`id` = 2

        @leaderbd.save
      end
      if params[:A] or params[:B] or params[:C] or params[:D] or params[:mcmc]
        if Integer(params[:id])==Bollywood.count()
---
SELECT COUNT(*) FROM `bollywoods`

    def set_bollywood
      if Integer(params[:id]) <= Bollywood.count
            @bollywood = Bollywood.find(params[:id])
---
SELECT  `bollywoods`.* FROM `bollywoods` WHERE `bollywoods`.`id` = 1 LIMIT 1