app/controllers/crickets_controller.rb

  def index
    @curscore=Leaderboard.find_by_user_id(current_user.id)
    @fupd=Leaderboard.find_by_user_id(current_user.id)
    @crickets = Leaderboard.order('cmax DESC')
    if @fupd.ccur == Cricket.count()
      @fupd.Cricket = 0
      @fupd.ccur =0
      @fupd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY cmax DESC
SELECT COUNT(*) FROM `crickets`
UPDATE `leaderboards` SET `ccur` = 0, `Cricket` = 0, `updated_at` = '2017-09-17 14:42:56' WHERE `leaderboards`.`id` = 3

  def show
    @string=''
    @leaderbd=Leaderboard.find_by_user_id(current_user.id)
    @location='/crickets/'+(Integer(params[:id])+1).to_s
    @leaderbd.ccur=Integer(params[:id])
    if params[:id]=='1'
      @leaderbd.Cricket=0
      @leaderbd.cmax=@leaderbd.cmax > @leaderbd.Cricket ? @leaderbd.cmax : @leaderbd.Cricket

    end
    @leaderbd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
UPDATE `leaderboards` SET `Cricket` = 10, `updated_at` = '2017-09-17 12:05:04', `cmax` = 10 WHERE `leaderboards`.`id` = 2

        @leaderbd.save
      end
      if params[:A] or params[:B] or params[:C] or params[:D] or params[:mcmc]
        if Integer(params[:id])==Cricket.count()
---
SELECT COUNT(*) FROM `crickets`

    def set_cricket
      if Integer(params[:id]) <= Cricket.count
            @cricket = Cricket.find(params[:id])
---
SELECT  `crickets`.* FROM `crickets` WHERE `crickets`.`id` = 1 LIMIT 1