app/controllers/footballs_controller.rb

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY fmax DESC
SELECT COUNT(*) FROM `footballs`
UPDATE `leaderboards` SET `fcur` = 0, `Football` = 0, `updated_at` = '2017-09-17 13:57:54' WHERE `leaderboards`.`id` = 2
---
  def index
    @curscore=Leaderboard.find_by_user_id(current_user.id)
    @fupd=Leaderboard.find_by_user_id(current_user.id)
    @footballs = Leaderboard.order('fmax DESC')
    if @fupd.fcur == Football.count()
      @fupd.Football = 0
      @fupd.fcur =0
      @fupd.save

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
UPDATE `leaderboards` SET `Football` = 10, `updated_at` = '2017-09-17 12:58:16', `fmax` = 10 WHERE `leaderboards`.`id` = 2
---
  def show
    @string=''
    @leaderbd=Leaderboard.find_by_user_id(current_user.id)
    @location='/footballs/'+(Integer(params[:id])+1).to_s
    @leaderbd.fcur=Integer(params[:id])
    if params[:id]=='1'
      @leaderbd.Football=0
      @leaderbd.fmax=@leaderbd.fmax > @leaderbd.Football ? @leaderbd.fmax : @leaderbd.Football

    end
    @leaderbd.save

SELECT COUNT(*) FROM `footballs`
---
        @leaderbd.save
      end
      if params[:A] or params[:B] or params[:C] or params[:D] or params[:mcmc]
        if Integer(params[:id])==Football.count()

SELECT  `footballs`.* FROM `footballs` WHERE `footballs`.`id` = 1 LIMIT 1
---
    def set_football
      if Integer(params[:id]) <= Football.count
            @football = Football.find(params[:id])