app/controllers/hollywoods_controller.rb

  def index
    @curscore=Leaderboard.find_by_user_id(current_user.id)
    @hupd=Leaderboard.find_by_user_id(current_user.id)
    @hollywoods = Leaderboard.order('hmax DESC')
    if @hupd.hcur == Hollywood.count()
      @hupd.Hollywood = 0
      @hupd.hcur =0
      @hupd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY hmax DESC
SELECT COUNT(*) FROM `hollywoods`
UPDATE `leaderboards` SET `hcur` = 0, `Hollywood` = 0, `updated_at` = '2017-09-17 14:20:47' WHERE `leaderboards`.`id` = 2

  def show
    @string=''
    @leaderbd=Leaderboard.find_by_user_id(current_user.id)
    @location='/hollywoods/'+(Integer(params[:id])+1).to_s
    @leaderbd.hcur=Integer(params[:id])
    if params[:id]=='1'
      @leaderbd.Hollywood=0
      @leaderbd.hmax=@leaderbd.hmax > @leaderbd.Hollywood ? @leaderbd.hmax : @leaderbd.Hollywood

    end
    @leaderbd.save
---
SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
UPDATE `leaderboards` SET `Hollywood` = 20, `updated_at` = '2017-09-17 14:03:41', `hmax` = 20 WHERE `leaderboards`.`id` = 2

        @leaderbd.save
      end
      if params[:A] or params[:B] or params[:C] or params[:D] or params[:mcmc]
        if Integer(params[:id])==Hollywood.count()
---
SELECT COUNT(*) FROM `hollywoods`

    def set_hollywood
      if Integer(params[:id]) <= Hollywood.count
            @hollywood = Hollywood.find(params[:id])
---
SELECT  `hollywoods`.* FROM `hollywoods` WHERE `hollywoods`.`id` = 1 LIMIT 1