app/controllers/leaderboards_controller.rb

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`user_id` = 2 LIMIT 1
SELECT `leaderboards`.* FROM `leaderboards` ORDER BY hollywood+bollywood DESC
---
  def index
    @curscore=Leaderboard.find_by_user_id(current_user.id)
    @leadermovie = Leaderboard.order('hmax+bmax DESC')