app/controllers/users/registrations_controller.rb

  def create
    super
    if current_user
      Leaderboard.create(user_id:current_user.id)
---
INSERT INTO `leaderboards` (`user_id`, `created_at`, `updated_at`) VALUES (3, '2017-09-16 15:12:31', '2017-09-16 15:12:31')
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('1@gmail.com', '$2a$11$6ktYifE6p5QkMtICFLzWbOJ7wac6KrBfRRiFAQAl058yKnnR3GltS', '2017-09-16 15:12:31', '2017-09-16 15:12:31')